orangepi-xunlong/linux-orangepi/drivers/net/wireless/rtl8703as/core/rtw_pwrctrl.c
#if defined(CONFIG_FWLPS_IN_IPS) && defined(CONFIG_PNO_SUPPORT)
void rtw_set_fw_in_ips_mode(PADAPTER padapter, u8 enable)
{
	struct hal_ops *pHalFunc = &padapter->HalFunc;
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(padapter);
	int cnt=0;
	u32 start_time;
	u8 val8 = 0;
	u8 cpwm_orig, cpwm_now;
	u8 parm[H2C_INACTIVE_PS_LEN]={0};

	if (padapter->netif_up == _FALSE) {
		DBG_871X("%s: ERROR, netif is down\n", __func__);
		return;
	}

	if (pHalFunc->fill_h2c_cmd == NULL) {
		DBG_871X("%s: Please hook fill_h2c_cmd first!\n", __func__);
		return;
	}

	//u8 cmd_param; //BIT0:enable, BIT1:NoConnect32k
	if (enable) {

#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_IpsNotify(padapter, pwrpriv->ips_mode_req);
#endif
		//Enter IPS
		DBG_871X("%s: issue H2C to FW when entering IPS\n", __func__);
		parm[0] = 0x03;
		parm[1] = 0x01;
		parm[2] = 0x01;
		pHalFunc->fill_h2c_cmd(padapter, //H2C_FWLPS_IN_IPS_,
					H2C_INACTIVE_PS_,
					H2C_INACTIVE_PS_LEN, parm);
		//poll 0x1cc to make sure H2C command already finished by FW; MAC_0x1cc=0 means H2C done by FW.
		do{
			val8 = rtw_read8(padapter, REG_HMETFR);
			cnt++;
			DBG_871X("%s  polling REG_HMETFR=0x%x, cnt=%d \n",
					__func__, val8, cnt);
			rtw_mdelay_os(10);
		}while(cnt<100 && (val8!=0));

		//H2C done, enter 32k
		if (val8 == 0) {
			//ser rpwm to enter 32k
			val8 = rtw_read8(padapter, SDIO_LOCAL_BASE|SDIO_REG_HRPWM1);
			DBG_871X("%s: read rpwm=%02x\n", __FUNCTION__, val8);
			val8 += 0x80;
			val8 |= BIT(0);
			rtw_write8(padapter, SDIO_LOCAL_BASE|SDIO_REG_HRPWM1, val8);
			DBG_871X("%s: write rpwm=%02x\n", __FUNCTION__, val8);
			adapter_to_pwrctl(padapter)->tog = (val8 + 0x80) & 0x80;
			cnt = val8 = 0;
			do {
				val8 = rtw_read8(padapter, REG_CR);
				cnt++;
				DBG_871X("%s  polling 0x100=0x%x, cnt=%d \n",
						__func__, val8, cnt);
				DBG_871X("%s 0x08:%02x, 0x03:%02x\n",
						__func__,
						rtw_read8(padapter, 0x08),
						rtw_read8(padapter, 0x03));
				rtw_mdelay_os(10);
			} while(cnt<20 && (val8!=0xEA));
#ifdef DBG_CHECK_FW_PS_STATE
			if(val8 != 0xEA) {
				DBG_871X("MAC_1B8=0x%08x\n",
						rtw_read32(padapter, 0x1b8));
				DBG_871X("MAC_1C0=%08x, MAC_1C4=%08x, MAC_1C8=%08x, MAC_1CC=%08x\n",
						rtw_read32(padapter, 0x1c0),
						rtw_read32(padapter, 0x1c4),
						rtw_read32(padapter, 0x1c8),
						rtw_read32(padapter, 0x1cc));
#endif //DBG_CHECK_FW_PS_STATE
			} else {
				DBG_871X("MAC_1C0=%08x, MAC_1C4=%08x, MAC_1C8=%08x, MAC_1CC=%08x\n",
						rtw_read32(padapter, 0x1c0),
						rtw_read32(padapter, 0x1c4),
						rtw_read32(padapter, 0x1c8),
						rtw_read32(padapter, 0x1cc));
			}
		}
	} else {
		//Leave IPS
		DBG_871X("%s: Leaving IPS in FWLPS state\n", __func__);

		//for polling cpwm
		cpwm_orig = 0;
		rtw_hal_get_hwreg(padapter, HW_VAR_CPWM, &cpwm_orig);

		//ser rpwm
		val8 = rtw_read8(padapter, SDIO_LOCAL_BASE|SDIO_REG_HRPWM1);
		val8 &= 0x80;
		val8 += 0x80;
		val8 |= BIT(6);
		rtw_write8(padapter, SDIO_LOCAL_BASE|SDIO_REG_HRPWM1, val8);
		DBG_871X("%s: write rpwm=%02x\n", __FUNCTION__, val8);
		adapter_to_pwrctl(padapter)->tog = (val8 + 0x80) & 0x80;

		//do polling cpwm
		start_time = rtw_get_current_time();
		do {

			rtw_mdelay_os(1);

			rtw_hal_get_hwreg(padapter, HW_VAR_CPWM, &cpwm_now);
			if ((cpwm_orig ^ cpwm_now) & 0x80) {
#ifdef DBG_CHECK_FW_PS_STATE				
				DBG_871X("%s: polling cpwm ok when leaving IPS in FWLPS state, cpwm_orig=%02x, cpwm_now=%02x, 0x100=0x%x \n"
				, __FUNCTION__, cpwm_orig, cpwm_now, rtw_read8(padapter, REG_CR));
#endif //DBG_CHECK_FW_PS_STATE
				break;
			}

			if (rtw_get_passing_time_ms(start_time) > 100)
			{
				DBG_871X("%s: polling cpwm timeout when leaving IPS in FWLPS state\n", __FUNCTION__);
				break;
			}
		} while (1);

		parm[0] = 0x0;
		parm[1] = 0x0;
		parm[2] = 0x0;
		pHalFunc->fill_h2c_cmd(padapter, H2C_INACTIVE_PS_,
					H2C_INACTIVE_PS_LEN, parm);
#ifdef CONFIG_BT_COEXIST
		rtw_btcoex_IpsNotify(padapter, IPS_NONE);
#endif
	}
}
#endif //CONFIG_PNO_SUPPORT

void rtw_set_ps_mode(PADAPTER padapter, u8 ps_mode, u8 smart_ps, u8 bcn_ant_mode, const char *msg)
{
	struct pwrctrl_priv *pwrpriv = adapter_to_pwrctl(padapter);
	struct dvobj_priv *psdpriv = padapter->dvobj;
	struct debug_priv *pdbgpriv = &psdpriv->drv_dbg;
#ifdef CONFIG_P2P
	struct wifidirect_info	*pwdinfo = &( padapter->wdinfo );
#endif //CONFIG_P2P
#ifdef CONFIG_TDLS
	struct sta_priv *pstapriv = &padapter->stapriv;
	_irqL irqL;
	int i, j;
	_list	*plist, *phead;
	struct sta_info *ptdls_sta;
#endif //CONFIG_TDLS

_func_enter_;

	RT_TRACE(_module_rtl871x_pwrctrl_c_, _drv_notice_,
			 ("%s: PowerMode=%d Smart_PS=%d\n",
			  __FUNCTION__, ps_mode, smart_ps));

	if(ps_mode > PM_Card_Disable) {
		RT_TRACE(_module_rtl871x_pwrctrl_c_,_drv_err_,("ps_mode:%d error\n", ps_mode));
		return;
	}

	if (pwrpriv->pwr_mode == ps_mode)
	{
		if (PS_MODE_ACTIVE == ps_mode) return;

#ifndef CONFIG_BT_COEXIST
		if ((pwrpriv->smart_ps == smart_ps) &&
			(pwrpriv->bcn_ant_mode == bcn_ant_mode))
		{
			return;
		}
#endif // !CONFIG_BT_COEXIST
	}

#ifdef CONFIG_LPS_LCLK
	_enter_pwrlock(&pwrpriv->lock);
#endif

	//if(pwrpriv->pwr_mode == PS_MODE_ACTIVE)
	if(ps_mode == PS_MODE_ACTIVE)
	{
		if (1
#ifdef CONFIG_BT_COEXIST
			&& (((rtw_btcoex_IsBtControlLps(padapter) == _FALSE)
#ifdef CONFIG_P2P_PS
					&& (pwdinfo->opp_ps == 0)
#endif // CONFIG_P2P_PS
					)
				|| ((rtw_btcoex_IsBtControlLps(padapter) == _TRUE)
					&& (rtw_btcoex_IsLpsOn(padapter) == _FALSE))
				)
#else // !CONFIG_BT_COEXIST
#ifdef CONFIG_P2P_PS
			&& (pwdinfo->opp_ps == 0)
#endif // CONFIG_P2P_PS
#endif // !CONFIG_BT_COEXIST
			)
		{
			DBG_871X(FUNC_ADPT_FMT" Leave 802.11 power save - %s\n",
				FUNC_ADPT_ARG(padapter), msg);

#ifdef CONFIG_TDLS
			_enter_critical_bh(&pstapriv->sta_hash_lock, &irqL);

			for(i=0; i< NUM_STA; i++)
			{
				phead = &(pstapriv->sta_hash[i]);
				plist = get_next(phead);

				while ((rtw_end_of_queue_search(phead, plist)) == _FALSE)
				{
					ptdls_sta = LIST_CONTAINOR(plist, struct sta_info, hash_list);

					if( ptdls_sta->tdls_sta_state & TDLS_LINKED_STATE )
						issue_nulldata_to_TDLS_peer_STA(padapter, ptdls_sta->hwaddr, 0, 0, 0);
					plist = get_next(plist);
				}
			}

			_exit_critical_bh(&pstapriv->sta_hash_lock, &irqL);
#endif //CONFIG_TDLS

